In [25]:
import numpy as np
import pandas as pd

##  Pandas02
- 데이터 프레임은 시리즈의 조합이다.
- 데이터 프레임 생성
- 데이터 프레임 인덱싱

### 데이터 프레임 생성1

- 딕셔너리 리스트 => 데이터 프레임
- 딕셔너리리스트 구조 : 딕셔너리 키 하나당 리스트 1개
```
{키1:[값1, 값2], 키2:[값1, 값2]....}
```
- 데이터프레임변수 = pd.DataFrame(딕셔너리리스트)

    ```
    행의 인덱스가 숫자 / 컬럼 인덱스는 딕셔너리의 키값
    ```

In [7]:
# 딕셔너리 리스트
dictList1 = {
    'user1' : [30, 40, 80],
    'user2' : [55, 69, 34],
    'user3' : [3, 6, 9],
}
print(dictList1)
print(type(dictList1))

{'user1': [30, 40, 80], 'user2': [55, 69, 34], 'user3': [3, 6, 9]}
<class 'dict'>

In [18]:
df1 = pd.DataFrame(dictList1)
print(df1)
print(type(df1))
print(df1.shape)

   user1  user2  user3
0     30     55      3
1     40     69      6
2     80     34      9
<class 'pandas.core.frame.DataFrame'>
(3, 3)

In [20]:
# 데이터 프레임 컬럼 호출
# 데이터프레임변수[컬럼키]
print(df1['user1'])
print(type(df1['user1']))

0    30
1    40
2    80
Name: user1, dtype: int64
<class 'pandas.core.series.Series'>

### 데이터 프레임 생성2

- 딕셔너리 딕셔너리 리스트(이중딕셔너리리스트) => 데이터 프레임
- 딕셔너리 딕셔너리 리스트
    : 딕셔너리 키 하나당 딕셔너리 리스트
```
{키1:{키1-1:값1, 키1-2:값2}, 키2:{키2-1:값1, 키2-2:값2}....}
```
- 데이터프레임변수 = pd.DataFrame(딕셔너리리스트)

    ```
    행의 인덱스가 각 키의 딕셔너리안의 키
    컬럼 인덱스는 딕셔너리의 키값
    ```

In [29]:
# 이중 딕셔너리 구조 생성
dictdictList1 = {'main1':{'sub1':'value1', 'sub2':'value2', 'sub3':'value3',},
    'main2':{'sub1':'value1', 'sub2':'value2', 'sub3':'value3',},
    'main3':{'sub1':'value1', 'sub2':'value2', 'sub3':'value3',}}
print(dictdictList1)
print(type(dictdictList1))

{'main1': {'sub1': 'value1', 'sub2': 'value2', 'sub3': 'value3'}, 'main2': {'sub1': 'value1', 'sub2': 'value2', 'sub3': 'value3'}, 'main3': {'sub1': 'value1', 'sub2': 'value2', 'sub3': 'value3'}}
<class 'dict'>

In [30]:
dict2 =pd.DataFrame(dictdictList1)
dict2

       main1   main2   main3
sub1  value1  value1  value1
sub2  value2  value2  value2
sub3  value3  value3  value3

In [35]:
print(dict2['main1'])
print(type(dict2['main1']))

sub1    value1
sub2    value2
sub3    value3
Name: main1, dtype: object
<class 'pandas.core.series.Series'>

In [41]:
print(dict2['main1']['sub1'])
print(dict2['main1'][0])

value1
value1

## 데이터프레임의 속성

- 데이터프레임변수.index
- 데이터프레임변수.values
- 데이터프레임변수.columns
- 데이터프레임변수.index.name = 인덱스이름
- 데이터프레임변수.columns.name = 컬럼 전체 이름

In [55]:
print(dict2)
print('*'*50)
print(dict2.index)
dict2.index.name = 'title1'
print('*'*50)
print(dict2.values)
print('*'*50)
print(dict2.columns)
dict2.columns.name = 'columns_name'
print('*'*50)
print(dict2)

columns_name   main1   main2   main3
title1
sub1          value1  value1  value1
sub2          value2  value2  value2
sub3          value3  value3  value3
**************************************************
Index(['sub1', 'sub2', 'sub3'], dtype='object', name='title1')
**************************************************
[['value1' 'value1' 'value1']
 ['value2' 'value2' 'value2']
 ['value3' 'value3' 'value3']]
**************************************************
Index(['main1', 'main2', 'main3'], dtype='object', name='columns_name')
**************************************************
columns_name   main1   main2   main3
title1
sub1          value1  value1  value1
sub2          value2  value2  value2
sub3          value3  value3  value3

### 데이터 프레임 생성3 - 인덱스랑 컬럼명 함께 지정

- 데이터프레임변수 = pd.DataFrame(집합형자료들,
                    index=인덱스배열,
                    columns=컬럼명리스트)

In [66]:
# {키:리스트 조합}
data1 = {'name':['신데렐라', '이몽룡', '성춘향'],
         'age':[18, 17, 23],
         'addr':['서울','부산','인천']}
data1

{'name': ['신데렐라', '이몽룡', '성춘향'],
 'age': [18, 17, 23],
 'addr': ['서울', '부산', '인천']}

In [74]:
df5 = pd.DataFrame(data1, index=['one', 'two', 'three'])
df5
df5.columns=['이름','나이','거주지']
df5
# df5 = pd.DataFrame(data1, index=['one', 'two', 'three'], columns=['이름','나이','거주지']) # 이렇게하면 안되네

         이름  나이 거주지
one    신데렐라  18  서울
two     이몽룡  17  부산
three   성춘향  23  인천

### 데이터프레임생성 4
1) 2차원리스트 새엇ㅇ
2) 데이터프레임변수 = pd.DataFrame(2차원리스트)

In [77]:
data2 = [['신데렐라', '이몽룡', '성춘향'],
         [18, 17, 23],
         ['서울','부산','인천']]
data2

[['신데렐라', '이몽룡', '성춘향'], [18, 17, 23], ['서울', '부산', '인천']]

In [83]:
df7 = pd.DataFrame(data2, columns=['c1','c2','c3'], index=['i1','i2','i3'])
df7
# 기존에 columns가 값이 있으면 새로 추가하면 values들이 다 Nan뜨네 비어있을때 이렇게 해야하나봄

      c1   c2   c3
i1  신데렐라  이몽룡  성춘향
i2    18   17   23
i3    서울   부산   인천

# 데이터프레임생성 5
- 1) 시리즈변수1, 시리즈변수2
- 2) 데이터프레임변수 = pd.DataFrame(시리즈데이트)

In [87]:
# 시리즈 생성
ss1 = pd.Series({'a':'aaa', 'b':'bbb', 'c':'ccc'})
ss2 = pd.Series({'a':'가', 'b':'나', 'c':'다'})
print(ss1)
print('*'*20)
print(ss2)

a    aaa
b    bbb
c    ccc
dtype: object
********************
a    가
b    나
c    다
dtype: object

In [89]:
df9 = pd.DataFrame([ss1,ss2], index=['one','two'])
df9

       a    b    c
one  aaa  bbb  ccc
two    가    나    다

## 데이터프레임 컬럼 추가/삭제

- 컬럼 인덱싱
- 컬럼명 값 변경
- 컬럼 추가
- 컬럼 삭제

In [91]:
np10 = np.arange(1,13).reshape(3,4)
np10

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [109]:
df10 = pd.DataFrame(np10, columns=['c1','c2','c3','c4'],index=['r1','r2','r3'])
df10

    c1  c2  c3  c4
r1   1   2   3   4
r2   5   6   7   8
r3   9  10  11  12

### 컬럼명으로 호출하기
### 데이터프레임[컬럼명]

- 데이터프레임명[컬럼명]
- 데이터프레임명[[컬럼명1, 컬럼명2]]

In [110]:
df10['c1']

r1    1
r2    5
r3    9
Name: c1, dtype: int32

In [114]:
# 컬럼 추가하기
# 데이터프레임변수[세로운컬럼명] = 값
df10['c5'] = 100
df10['c7'] = ['키','키','킼']

df10

    c1  c2  c3  c4   c5  c6 c7
r1   1   2   3   4  100 -10  키
r2   5   6   7   8  100 -20  키
r3   9  10  11  12  100 -50  킼

### 컬럼 값 변경하기

- 데이터프레임변수[컬럼명] = 값/리스트

In [115]:
df10['c6'] = [-10,-20,-50]
df10

    c1  c2  c3  c4   c5  c6 c7
r1   1   2   3   4  100 -10  키
r2   5   6   7   8  100 -20  키
r3   9  10  11  12  100 -50  킼

### 컬럼 삭제하기

- del 데이터프레임변수[컬럼명]

In [116]:
del df10['c4']
df10

    c1  c2  c3   c5  c6 c7
r1   1   2   3  100 -10  키
r2   5   6   7  100 -20  키
r3   9  10  11  100 -50  킼

## 퀴즈

```
1) 아래와 같은 데이터프레임을 생성하여라

        국어   영어   수학   과학
학생1    ?      ?      ?     ?  
학생2    ?      ?      ?     ?  
학생3    ?      ?      ?     ?  
학생4    ?      ?      ?     ?  

2) 1번의 데이터프레임에 총점과 평균 컬럼을 추가하여라

3) '수학' 컬럼을 삭제하여라

4) 2번의 스타일로 데이터프레임 교체
```

In [250]:
# 1
scores =[[80,70,90,100],[60,40,30,20,],[90,80,90,100],[10,20,10,40]]
df100 = pd.DataFrame(scores, index=['학생1','학생2','학생3','학생4'], columns=['국어','영어','수학','과학'])
df100

     국어  영어  수학   과학
학생1  80  70  90  100
학생2  60  40  30   20
학생3  90  80  90  100
학생4  10  20  10   40

In [246]:
#2
total_scores = []
for i in range(1,len(df100)+1):
    a= sum(df100.loc[f'학생{i}'][:-2])
    total_scores.append(a)
df100['총점'] = total_scores
avg_scores = [(x//(df100.shape[1]-2)) for x in total_scores]
df100['평균'] = avg_scores
df100

     국어  영어   과학  평균   총점
학생1  80  70  100  83  250
학생2  60  40   20  40  120
학생3  90  80  100  90  270
학생4  10  20   40  23   70

In [247]:
#3 
# del df100['수학']
df100

     국어  영어   과학  평균   총점
학생1  80  70  100  83  250
학생2  60  40   20  40  120
학생3  90  80  100  90  270
학생4  10  20   40  23   70

In [237]:
#4
total_scores = []
for i in range(1,len(df100)+1):
    a= sum(df100.loc[f'학생{i}'][:-2])
    total_scores.append(a)
df100['총점'] = total_scores
avg_scores = [(x//(df100.shape[1]-2)) for x in total_scores]
df100['평균'] = avg_scores
df100

     국어  영어   과학   총점  평균
학생1  80  70  100  250  83
학생2  60  40   20  120  40
학생3  90  80  100  270  90
학생4  10  20   40   70  23

In [256]:
sum(df100['수학'])

220